In [7]:
 import pandas as pa
df=pa.DataFrame({'name':['Rakesh', 'Rajini', 'Kamal', 'Surya', 'Ajith'],
                 'age':[26,32,60,45,55]})

In [8]:
df[['name','age']]

     name  age
0  Rakesh   26
1  Rajini   32
2   Kamal   60
3   Surya   45
4   Ajith   55

In [9]:
df['age'].median()

np.float64(45.0)

In [10]:
df['age'].mean()

np.float64(43.6)

In [11]:
df.to_csv('employeage.csv')

In [12]:
age= pa.read_csv('employeage.csv')
age

   Unnamed: 0    name  age
0           0  Rakesh   26
1           1  Rajini   32
2           2   Kamal   60
3           3   Surya   45
4           4   Ajith   55

In [13]:
age[age['age']>40]

   Unnamed: 0   name  age
2           2  Kamal   60
3           3  Surya   45
4           4  Ajith   55

In [14]:
age.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  5 non-null      int64
 1   name        5 non-null      object
 2   age         5 non-null      int64
dtypes: int64(2), object(1)
memory usage: 252.0+ bytes

In [15]:
age.describe()

       Unnamed: 0        age
count    5.000000   5.000000
mean     2.000000  43.600000
std      1.581139  14.536162
min      0.000000  26.000000
25%      1.000000  32.000000
50%      2.000000  45.000000
75%      3.000000  55.000000
max      4.000000  60.000000

In [16]:
age.sort_values(by='age')

   Unnamed: 0    name  age
0           0  Rakesh   26
1           1  Rajini   32
3           3   Surya   45
4           4   Ajith   55
2           2   Kamal   60

In [17]:
age.sort_values(by='age', ascending=False)

   Unnamed: 0    name  age
2           2   Kamal   60
4           4   Ajith   55
3           3   Surya   45
1           1  Rajini   32
0           0  Rakesh   26

In [18]:
checkrecord= df.loc[df['name']=='Surya']
print(checkrecord)

    name  age
3  Surya   45

In [20]:
youngsters = df.loc[df['age']<35]
print(youngsters)

     name  age
0  Rakesh   26
1  Rajini   32

In [21]:
thirdrow = df.iloc[2]
print(thirdrow)

name    Kamal
age        60
Name: 2, dtype: object

In [24]:
specificrec = df.loc[(df['name']=='SRK') | (df['age']>50)]
print(specificrec)

    name  age
2  Kamal   60
4  Ajith   55

In [25]:
df['updateage']= df['age'].apply(lambda x: x+5 if x<40 else x)
df

     name  age  updateage
0  Rakesh   26         31
1  Rajini   32         37
2   Kamal   60         60
3   Surya   45         45
4   Ajith   55         55